Revit 2026 API

# CorrectionFactorSetIteratorMoveNext Method

---

Move the iterator one item forward.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual bool MoveNext()
```
```vb
Public Overridable Function MoveNext As Boolean
```
```cpp
public:
virtual bool MoveNext()
```
```fsharp
abstract MoveNext : unit -> bool
override MoveNext : unit -> bool
```

#### Return Value

Boolean Returns True if the iterator was successfully moved forward one item and the Current property will return a valid item. False will be returned it the iterator has reached the end of the set.

#### Implements

IEnumeratorMoveNext

MoveNext must be called before the Current property is valid with a new or Reset iterator in line with the expected behavior of IEnumerator.

#### Reference

CorrectionFactorSetIterator Class

Autodesk.Revit.DB.Electrical Namespace